In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('/content/Data.csv')

In [2]:
dataset =df.copy()
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [7]:
X = dataset.iloc[:,:-1].values
y = dataset.iloc[:,-1].values

In [9]:
from sklearn.impute import SimpleImputer

imputer = SimpleImputer(missing_values=np.nan,strategy='mean')
imputer = imputer.fit(X[:, 1:3])
X[:, 1:3] = imputer.transform(X[:, 1:3])

In [10]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [13]:
dataset['Age'] = X[:,1]
dataset['Salary'] = X[:,2]

   Country      Age   Salary Purchased
0   France       44    72000        No
1    Spain       27    48000       Yes
2  Germany       30    54000        No
3    Spain       38    61000        No
4  Germany       40  63777.8       Yes
5   France       35    58000       Yes
6    Spain  38.7778    52000        No
7   France       48    79000       Yes
8  Germany       50    83000        No
9   France       37    67000       Yes

In [ ]:
dataset = pd.get_dummies(dataset,columns=['Country','Purchased'])

In [17]:
dataset

       Age   Salary  Country_France  ...  Country_Spain  Purchased_No  Purchased_Yes
0       44    72000               1  ...              0             1              0
1       27    48000               0  ...              1             0              1
2       30    54000               0  ...              0             1              0
3       38    61000               0  ...              1             1              0
4       40  63777.8               0  ...              0             0              1
5       35    58000               1  ...              0             0              1
6  38.7778    52000               0  ...              1             1              0
7       48    79000               1  ...              0             0              1
8       50    83000               0  ...              0             1              0
9       37    67000               1  ...              0             0              1

[10 rows x 7 columns]

In [19]:
X = dataset.iloc[:,:5].values
y = dataset['Purchased_Yes'].values
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1], dtype=uint8)

In [20]:
from sklearn.linear_model import LogisticRegression
logist = LogisticRegression()

In [24]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2)

In [25]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train[:, :3] = sc.fit_transform(X_train[:, :3])
X_test[:, :3] = sc.transform(X_test[:, :3])

In [32]:
logist.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [35]:
logist.predict(X_test)

array([0, 1], dtype=uint8)

In [36]:
logist.score(X,y)

0.5